# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму
# *Пример:*
# - Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]

number = int(input("Введите число N: "))
ar = {}
sum = 0
for n in range(1, number + 1):
    ar[n] = round(((1 + (1 / n)) ** n), 2)
    sum += ar[n]
print(ar)
print('Сумма элементов списка равна', sum)